In [1]:
import pandas as pd

df=pd.DataFrame({'salary':[25000,48000,71000,85000,90000,55000],
                'city':['Bengaluru','Delhi','Hyderabad','Bengaluru','Hyderabad','Bengaluru'],
                'Gender':['male','female','female','female','male','male'],
                'Exp':[1,3,5,6,9,None]})
df

   salary       city  Gender  Exp
0   25000  Bengaluru    male  1.0
1   48000      Delhi  female  3.0
2   71000  Hyderabad  female  5.0
3   85000  Bengaluru  female  6.0
4   90000  Hyderabad    male  9.0
5   55000  Bengaluru    male  NaN

# * get_dummies

In [3]:
df1=pd.get_dummies(df[['city','Gender']])
df1

   city_Bengaluru  city_Delhi  city_Hyderabad  Gender_female  Gender_male
0               1           0               0              0            1
1               0           1               0              1            0
2               0           0               1              1            0
3               1           0               0              1            0
4               0           0               1              0            1
5               1           0               0              0            1

In [5]:
df1=pd.get_dummies(df[['city','Gender']],drop_first=True)

In [6]:
df1

   city_Delhi  city_Hyderabad  Gender_male
0           0               0            1
1           1               0            0
2           0               1            0
3           0               0            0
4           0               1            1
5           0               0            1

# Ordinal Encoder

In [7]:
from sklearn.preprocessing import OrdinalEncoder

In [8]:
emp=pd.DataFrame({'position':['SE','manager','Team lead','SSE'],
                 'project':['A','B','C','D'],
                 'salary':[25000,85000,71000,48000]})

emp

    position project  salary
0         SE       A   25000
1    manager       B   85000
2  Team lead       C   71000
3        SSE       D   48000

In [15]:
ord_enc=OrdinalEncoder(categories=[['SE','SSE','Team lead','manager'],['A','B','C','D']])

In [16]:
encoder_df=ord_enc.fit_transform(emp[['position','project']])

In [17]:
encoder_df

array([[0., 0.],
       [3., 1.],
       [2., 2.],
       [1., 3.]])

# * Binary Encoder

In [18]:
import pandas as pd

In [23]:
df=pd.DataFrame({'cat_data':['A','B','C','D','E','F','G','H','I','A','A','D']})

In [24]:
df

   cat_data
0         A
1         B
2         C
3         D
4         E
5         F
6         G
7         H
8         I
9         A
10        A
11        D

In [30]:
# !pip install  category_encoder

In [26]:
from category_encoders import BinaryEncoder

In [27]:
from sklearn.preprocessing import OneHotEncoder

In [28]:
bi_enc=BinaryEncoder()

In [29]:
df_bi=bi_enc.fit_transform(df)
df_bi

    cat_data_0  cat_data_1  cat_data_2  cat_data_3
0            0           0           0           1
1            0           0           1           0
2            0           0           1           1
3            0           1           0           0
4            0           1           0           1
5            0           1           1           0
6            0           1           1           1
7            1           0           0           0
8            1           0           0           1
9            0           0           0           1
10           0           0           0           1
11           0           1           0           0

# * comparing with OneHotEncoder

In [51]:
ohe=OneHotEncoder(sparse=False)
s=ohe.fit_transform(df)
s

array([[1., 0., 0., 0., 0., 0., 1., 0., 0., 0., 1., 1., 0., 0., 0., 0.,
        0.],
       [0., 1., 0., 0., 0., 0., 0., 1., 0., 1., 0., 0., 1., 0., 0., 0.,
        0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 1., 1., 0., 0., 0., 1., 0., 0.,
        0.],
       [0., 0., 0., 0., 1., 0., 1., 0., 0., 1., 0., 0., 0., 0., 1., 0.,
        0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 1., 0., 1., 0., 0., 0., 0., 1.,
        0.],
       [0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0., 0.,
        1.]])

# * Knn Imputer

In [50]:
df=pd.DataFrame({'salary':[25000,48000,71000,85000,90000,55000],
                'city':['Bengaluru','Delhi','Hyderabad','Bengaluru','Hyderabad','Bengaluru'],
                'Gender':['male','female','female','female','male','male'],
                'Exp':[1,3,5,6,9,None]})
df

   salary       city  Gender  Exp
0   25000  Bengaluru    male  1.0
1   48000      Delhi  female  3.0
2   71000  Hyderabad  female  5.0
3   85000  Bengaluru  female  6.0
4   90000  Hyderabad    male  9.0
5   55000  Bengaluru    male  NaN

In [36]:
from sklearn.impute import KNNImputer

In [37]:
knnimp=KNNImputer(n_neighbors=2)
knn_imp=pd.DataFrame(knnimp.fit_transform(df[['salary','Exp']]))

knn_imp

         0    1
0  25000.0  1.0
1  48000.0  3.0
2  71000.0  5.0
3  85000.0  6.0
4  90000.0  9.0
5  55000.0  4.0

# * Iterative imputer

In [52]:
from sklearn.experimental import enable_iterative_imputer

In [55]:
from sklearn.impute import IterativeImputer

In [56]:
df=pd.DataFrame({'salary':[25000,48000,71000,85000,90000,55000],
                'city':['Bengaluru','Delhi','Hyderabad','Bengaluru','Hyderabad','Bengaluru'],
                'Gender':['male','female','female','female','male','male'],
                'Exp':[1,3,5,6,9,None]})
df

   salary       city  Gender  Exp
0   25000  Bengaluru    male  1.0
1   48000      Delhi  female  3.0
2   71000  Hyderabad  female  5.0
3   85000  Bengaluru  female  6.0
4   90000  Hyderabad    male  9.0
5   55000  Bengaluru    male  NaN

In [57]:
iter_impute=IterativeImputer()

In [58]:
iter_imp=pd.DataFrame(iter_impute.fit_transform(df[['salary','Exp']]),columns=['salary','Exp'])

In [59]:
iter_imp

    salary       Exp
0  25000.0  1.000000
1  48000.0  3.000000
2  71000.0  5.000000
3  85000.0  6.000000
4  90000.0  9.000000
5  55000.0  3.864759